// Задача 34: Задайте массив заполненный случайными положительными трёхзначными числами.
// Напишите программу, которая покажет количество чётных чисел в массиве.

// [345, 897, 568, 234] -> 2

int[] array = GetRandomArray(6, 100, 1000);

int count = GetCountEvenNumbers(array);

Console.Clear();

Console.WriteLine($"In Your Array [{string.Join(", ", array)}] : {count} even element(s)");

int[] GetRandomArray(int length, int minValue, int maxValue)
{
    int[] array = new int[length];

    Random random = new Random();

    for (int i = 0; i < array.Length; i++)
    {
        array[i] = random.Next(minValue, maxValue + 1);
    }
    return array;
}

int GetCountEvenNumbers(int[] array)
{
    int count = 0;

    for (int i = 0; i < array.Length; i++)
    {
        if (array[i] % 2 != 1)
        {
            count++;
        }
    }
    return count;
}
