// Напишите программу, которая принимает на вход трёхзначное число
// и на выходе показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8 
// 918 -> 1

// Console.WriteLine("Введите трёхзначное число: ");

// int.TryParse(Console.ReadLine(), out int number);

// Console.WriteLine($"Вторая цифра числа {number} равна {(number / 10) % 10}");

//*********************************************************************************************


// Console.WriteLine("Введите трёхзначное число: ");

// bool isnumber = int.TryParse(Console.ReadLine(), out int number);

// if (isnumber) 
// {
// Console.WriteLine($"Вторая цифра числа {number} равна {(number / 10) % 10}");
// }
// else
// {
//     Console.WriteLine("Вы ввели не число.");
//}    


// *******************************************************************************************
// Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6
// ****************************************************************************************************

Console.WriteLine("Введите число: ");

int.TryParse(Console.ReadLine(), out int number);

int i = 2;

number =  number.ToString()[i] - '0';

Console.WriteLine(number);

